src/Documents/Авторекомендация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Авторекомендация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеАвтопроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗаключениеАвтопроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Авторекомендация/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ТолькоНовыеПриИзмененииНаСервере()
	Если ПоказатьВсе = Истина Тогда
		ТекстОригинальногоЗапроса = Список.ТекстЗапроса;
		Список.ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Авторекомендация.Ссылка КАК Ссылка,
		|	Авторекомендация.ВерсияДанных КАК ВерсияДанных,
		|	Авторекомендация.ПометкаУдаления КАК ПометкаУдаления,
		|	Авторекомендация.Номер КАК Номер,
		|	Авторекомендация.Дата КАК Дата,
		|	Авторекомендация.Проведен КАК Проведен,
		|	Авторекомендация.Заявка КАК Заявка,
		|	Авторекомендация.ЗаключениеАвтопроверки КАК ЗаключениеАвтопроверки,
		|	Авторекомендация.Представление КАК Представление,
		|	Авторекомендация.МоментВремени КАК МоментВремени
		|ИЗ
		|	Документ.Авторекомендация КАК Авторекомендация";
		Возврат;
	КонецЕсли;
	
	Список.ТекстЗапроса = ТекстОригинальногоЗапроса;
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНовыеПриИзменении(Элемент)
	ТолькоНовыеПриИзмененииНаСервере();
КонецПроцедуры
